Repository: Nguh-Prince/ChessTournament
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: fr

source: This value is not found on the list
fr: Cette valeur est introuvable dans la liste

source: The in and notIn selectors of this object are the same
fr: Les sélecteurs in et notIn de cet objet sont les mêmes

source: This field is required
fr: Cette champ est requis

source: Expected a number
fr: Attendu un nombre

source: The value of this field must be greater than %s
fr: La valeur de ce champ doit être supérieure à %s

source: This is not a valid date
fr: Ceci n'est pas une date valide

source: At least two names are required
fr: Au moins deux noms sont requis

source: Expected %s, got a value of %s
fr: Attendu %s, a obtenu une valeur de %s

source: This value does not exist on the list %s
fr: Cette valeur n'existe pas dans la liste %s

source: This value already exists in the list %s
fr: Cette valeur existe déjà dans la liste %s

source: The value of this input must be different from that of %s
fr: La valeur de cette entrée doit être différente de celle de %s

source: Item deleted successfully
fr: Élément supprimé avec succès

source: Error connecting to the server
fr: Erreur de connexion au serveur

source: You are not authorized to access this resource
fr: Vous n'êtes pas autorisé à accéder à cette ressource

source: Must be a number that is a power of 2 e.g 4, 8, 16, etc.
fr: Doit être un nombre qui est une puissance de 2, par exemple 4, 8, 16, etc.

source: Tournament added successfully
fr: Tournoi ajouté avec succès

source: View
fr: Afficher

source: Delete
fr: Supprimer

source: You cannot kickout a player that has not been enrolled
fr: Vous ne pouvez pas expulser un joueur qui n'a pas été inscrit

source: enroll or kickout must be set to true
fr: l'inscription ou le retrait doit être défini sur vrai

source: Player kicked out successfully
fr: Joueur expulsé avec succès

source: Game added successfully
fr: Jeu ajouté avec succès

source: Game updated successfully
fr: Jeu mis à jour avec succès

source: Winner set successfully
fr: Gagnant défini avec succès

source: Fixture successfully modified
fr: Appareil modifié avec succès

source: Error modifying fixture
fr: Erreur lors de la modification de la fixation

source: Error setting winner
fr: Erreur lors de la définition du gagnant

source: Select a winner before finishing the game
fr: Sélectionnez un gagnant avant de terminer le jeu

source: Enroll
fr: Inscrire

source: You have been enrolled successfully. Awaiting verification from the tournament's creator.
fr: Vous avez été inscrit avec succès. En attente de vérification du créateur du tournoi.

source: Pending
fr: En attente
