Repository: Nguh-Prince/ChessTournament
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Male
fr: Mâle

source: Female
fr: Femelle

source: Non binary
fr: Non binaire

source: Rather not say
fr: Plutôt ne pas dire

source: Player
fr: Joueur

source: Players
fr: Joueurs

source: Tournament category
fr: Catégorie de tournoi

source: Tournament categories
fr: Catégories de tournois

source: Finals
fr: Finales

source: Semi-finals
fr: Demi-finales

source: Quarter finals
fr: Quarts de finale

source: Tournament
fr: Tournoi

source: Tournaments
fr: Les Tournois

source: The total number of participants must be greater than 1
fr: Le nombre total de participants doit être supérieur à 1

source: The total number of participants must be a power of 2 i.e 2, 4, 8, 16, 32, etc.
fr: Le nombre total de participants doit être une puissance de 2 soit 2, 4, 8, 16, 32, etc.

source: There is another active tournament with the same name
fr: Il y a un autre tournoi actif avec le même nom

source: Tournament can only be started when %(number)d participants have been enrolled
fr: Le tournoi ne peut être démarré que lorsque %(number)d participants ont été inscrit

source: A tournament cannot be completed when it has not yet started
fr: Un tournoi ne peut pas être terminé s'il n'a pas encore commencé

source: The number of points for win, loss and draw must be different.
fr: Le nombre de points pour la victoire, la défaite et le match nul doit être différent.

source: The tournament is already full.
fr: Le tournoi est déjà complet.

source: Tournament participant
fr: Participant au tournoi

source: Tournament participants
fr: Participants aux tournois

source: Fixture
fr: Fixation

source: Fixtures
fr: Des fixations

source: A fixture cannot be dependent on more than 2 other fixtures
fr: Une fixation ne peut pas dépendre de plus de 2 autres fixations

source: Either both the parent and child fixtures are in tournaments or neither of them are
fr: Soit les matchs parent et enfant sont dans des tournois, soit aucun d'eux n'est

source: This fixture hs to be in the same tournament as its parent
fr: Cette fixation doit être dans le même tournoi que son parent

source: The fixture you are specifying is already dependent on 2 other fixtures
fr: La fixation que vous spécifiez dépend déjà de 2 autres fixations

source: A fixture cannot be dependent on fixtures that are in another tournament or not in a tournament at all
fr: Un match ne peut pas dépendre de matchs qui sont dans un autre tournoi ou pas du tout dans un tournoi

source: A fixture should have at most 2 children
fr: Une fixation doit avoir au plus 2 enfants

source: You are trying to add this fixture to a tournament that already has its total number of fixtures
fr: Vous essayez d'ajouter ce match à un tournoi qui a déjà son nombre total de matchs

source: A fixture's winner must be a player that is participating in that fixture
fr: Le gagnant d'un match doit être un joueur qui participe à ce match

source: White
fr: Blanc

source: Black
fr: Noir

source: Fixture already has two players
fr: La fixation a déjà deux joueurs

source: A fixture can only have one winner
fr: Une fixation ne peut avoir qu'un seul gagnant

source: This fixture can only be played by players that are participating in the tournament
fr: Ce match ne peut être joué que par des joueurs qui participent au tournoi

source: Fixture player
fr: Joueur du fixation

source: Fixture players
fr: Joueurs des fixations

source: Break
fr: Pause

source: After school
fr: Après l'école

source: Game
fr: Jeu

source: Games
fr: Jeux

source: White score must either be 0, 0.5 or 1
fr: Le score des blancs doit être soit 0, 0,5 ou 1

source: The game number must be a positive integer
fr: Le numéro du jeu doit être un entier positif

source: Fixture game result
fr: Resultat d'un match de fixation

source: Fixture game results
fr: Resultats des matchs des fixations

source: A game can have only 2 playerfixturegame records
fr: Un jeu ne peut avoir que 2 enregistrements de match de joueur

source: More than two players with the same color, change this instance's is_home value
fr: Plus de deux joueurs avec la même couleur, modifiez la valeur is_home de cette instance

source: The players of a game must be from the fixture the game is found in
fr: Les joueurs d'un match doivent appartenir au match dans lequel se trouve le match

source: Player cannot be kicked out of a tournament they are not participating in
fr: Le joueur ne peut pas être expulsé d'un tournoi auquel il ne participe pas

source: The number of points for a win, draw and loss must be different from each other
fr: Le nombre de points pour une victoire, un match nul et une défaite doit être différent l'un de l'autre

source: The score for this game must be either be %(list)s
fr: Le score pour ce jeu doit être soit %(list)s

source: This game must have a time greater than or equal to that of the games in the previous fixtures
fr: Ce match doit avoir un temps supérieur ou égal à celui des matchs des rencontres précédentes

source: A game can only have 2 players
fr: Une partie ne peut avoir que 2 joueurs

source: This game cannot be played before or at the same time as a game in a fixture preceding this game's fixture
fr: Ce match ne peut pas être joué avant ou en même temps qu'un match d'un match précédant le match de ce match

source: Another game is being played at the same time as this game
fr: Un autre match se joue en même temps que ce match

source: This game can only be played by players in its fixture
fr: Ce jeu ne peut être joué que par des joueurs dans sa fixation

source: There can only be one home and one away player
fr: Il ne peut y avoir qu'un joueur à domicile et un joueur à l'extérieur

source: The number of wins and losses for a game cannot exceed 1
fr: Le nombre de victoires et de défaites pour une partie ne peut pas dépasser 1

source: The number of draws for a game cannot exceed 2
fr: Le nombre de nuls pour un jeu ne peut excéder 2

source: The number of draws for a game can either be 2 or 0
fr: Le nombre de nuls pour un jeu peut être 2 ou 0

source: The number of wins must be equal to the number of losses
fr: Le nombre de victoires doit être égal au nombre de défaites

source: A player who has been kicked out of the tournament cannot be the winner of this fixture.
fr: Un joueur qui a été expulsé du tournoi ne peut pas être le vainqueur de ce match

source: This fixture already has a winner
fr: Cette fixation a déjà un gagnant

source: A winner cannot be set for a fixture with no games
fr: Un gagnant ne peut pas être défini pour un match sans match

source: A fixture cannot be finished when it has no winner
fr: Un match ne peut pas être terminé s'il n'y a pas de gagnant

source: Home
fr: Accueil

source: Settings
fr: Réglages

source: Log out
fr: Se deconnecter

source: You need to be signed in to enroll in a tournament
fr: Vous devez être connecté pour vous inscrire à un tournoi

source: Sign up
fr: S'inscrire

source: Log in
fr: Connexion

source: Delete item
fr: Supprimer un élément

source: Are you sure you want to delete this item?
fr: Êtes-vous sûr de bien vouloir supprimer cet élément?

source: Yes
fr: Oui

source: No
fr: Non

source: Mate
fr: Mat

source: Update profile
fr: Mettre à jour le profil

source: First and last name
fr: Noms et prénoms

source: Name
fr: Nom

source: Phone
fr: Numéro de téléphone

source: Email
fr: Adresse e-mail

source: Class
fr: Salle de classe

source: Gender
fr: Sexe

source: Non-binary
fr: Non binaire

source: Telegram username
fr: Nom d'utilisateur du Telegram

source: Upload image
fr: Soumettre une image

source: Create account
fr: Créer un compte

source: Next
fr: Suivant

source: Home page
fr: Accueil

source: Add tournament
fr: Ajouter un tournoi

source: Your tournaments
fr: Vos tournois

source: You have not created or been enrolled into any tournament.
fr: Vous n'avez pas créé ou été inscrit à un tournoi.

source: View all tournaments
fr: Afficher tous les tournois

source: New tournament
fr: Nouveau tournoi

source: Number of participants
fr: Nombre de participants

source: Number of points for win
fr: Nombre de points pour gagner

source: Number of points for loss
fr: Nombre de points pour la perte

source: Number of points for draw
fr: Nombre de points pour nul

source: Terms & Conditions
fr: Termes et Conditions

source: Select an image
fr: Sélectionnez une image

source: Login
fr: Connexion

source: Manage tournaments
fr: Gérer les tournois

source: Create, edit and enroll in tournaments of any kind
fr: Créez, éditez et inscrivez-vous à des tournois de toutes sortes

source: Track how you and your opponents have been performing during the tournament
fr: Suivez vos performances et celles de vos adversaires pendant le tournoi

source: Participant notifications
fr: Avis aux participants

source: Automatically notify participants of upcoming matches in tournaments they've been enrolled in through the app and Telegram
fr: Avertissez automatiquement les participants des matchs à venir dans les tournois qu'ils ont été inscrit via l'application et Telegram

source: Personal information
fr: Renseignements personnels

source: Username e.g john_doe
fr: Nom d'utilisateur par ex. john_doe

source: Password
fr: Mot de passe

source: Confirm password
fr: Confirmez le mot de passe

source: Sign in
fr: Se connecter

source: to your account
fr: à votre compte

source: Mate | Tournaments | %(id)s
fr: Mat | Tournois | %(id)s

source: Number of participants enrolled:
fr: Nombre de participants inscrits :

source: Total number of participants:
fr: Nombre total de participants :

source: View list of enrolled participants
fr: Voir la liste des participants inscrits

source: View fixture detail
fr: Voir le détail de fixation

source: Tournament layout
fr: Disposition du tournoi

source: Table layout
fr: Disposition du tableau

source: Bracket layout
fr: Disposition du tournoi

source: Fixture level
fr: Niveau de fixation

source: Winner
fr: Gagnant

source: This fixture has no players
fr: Ce match n'a pas de joueurs

source: Add a player
fr: Ajouter un joueur

source: Game #%(game_number)s
fr: Jeu #%(game_number)s

source: This fixture has no games
fr: Cette fixation n'a pas des jeux

source: Add a game
fr: Ajouter un jeu

source: This fixture has no winner
fr: Cette fixation n'a pas de gagnant

source: Pick a winner
fr: Choisissez un gagnant

source: Finish
fr: Terminer

source: Finished
fr: Finie

source: Not Finished
fr: Inachevée

source: Start
fr: Commencer

source: This tournament has not yet started
fr: Ce tournoi n'a pas encore commencé

source: List of participants
fr: Liste des participants

source: Kick out
fr: Expulser

source: Enroll
fr: Inscrire

source: Kicked out
fr: Expulsé

source: New game
fr: Nouveau jeu

source: Classroom*
fr: Salle de classe

source: Date & Time*
fr: Date & heure*

source: Minutes per player*
fr: Minutes par joueur*

source: Score
fr: Resultat

source: Draw
fr: Match nul

source: Win
fr: Victoire

source: Loss
fr: Perte

source: Submit
fr: Soumettre

source: Close
fr: Fermer

source: Finish fixture?
fr: Terminez la fixation?

source: Date & Time
fr: Date & heure*

source: Mate | Tournaments
fr: Mat | Tournois

source: All tournaments
fr: Tous les tournois

source: Search
fr: Parcourir

source: Terms &conditions
fr: Termes & conditions

source: Enrolling in this tournament implies that you have read and accepted the organizer's Rules and Regulations
fr: L'inscription à ce tournoi implique que vous avez lu et accepté les règlement de l'organisateur

source: Username or password incorrect
fr: Nom d'utilisateur ou mot de passes incorrect

source: Your account is currently inactive
fr: Votre compte est actuellement inactif

source: First and last name required
fr: Prénom et nom requis

source: Username required
fr: Nom d'utilisateur requis

source: Password required
fr: Mot de passe requis

source: Username already exists
fr: Ce nom d'utilisateur existe déjà

source: user
fr: utilisateur

source: person
fr: personne

source: telegram username
fr: nom d'utilisateur du Telegram

source: A %(model_name)s already exists with this %(field)s
fr: Un %(model_name)s existe déjà avec ce %(field)s
